package student_Vladislavs_Solims.homework.lesson_5.level_2;

public class Task15 {
/*
    Напишите программу, в которой:
            - создайте массив целых чисел длиной 3,
            - заполните каждую ячейку массива случайным числом,
 - выведите значение каждой ячейки на консоль,
 - увеличьте значение каждой ячейки на 2,
            - выведите значение каждой ячейки на консоль.
*/
public static void main(String[] args) {
    int[] numbers = {10,20,30};
    for (int i = 0; i < numbers.length; i++) {
        System.out.println(numbers[i]);
    }
    }

}
