package student_kristina_sapovalova.homework.lesson_3.level_2;

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
public class Task8 {

    public static void main(String[] args) {

        String userName = "Kristina";
        String greeting = "Hi " + userName + "!";

        System.out.println(greeting);

    }
}

/* Учимся работать со строками.

Тема: Конкатенация строк.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль приветствие типа "Hi YourName".

Подсказка: любые две строки можно соединять знаком "+".

    String userName = "Viktor";
    String greeting = "Hi " + userName + "!"; */
