package student_kristina_sapovalova.homework.lesson_2.task_32;

/* Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного комментариев. */

public class Task32 {

    public static void main(String[] args) {

        //Single line comments
        System.out.println("Single line comments");

         /* Multiline
         comments
         example */
        System.out.println("Multiline comments");
    }
}
