package student_olga_dubrovskaja.homework.lesson_2.level_7;

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
public class Task32 {
    public static void main(String[] args) { // main method
        System.out.println("I am almost done with the homework");
        // Prints out a message
        // Then goes to next line
    }
}


//Напишите программу и продемонстрируйте в ней использование
//однострочного и многострочного комментариев.