package student_kristina_sapovalova.homework.lesson_2.task_28;

/* Задание: дайте правильные с точки зрения Java кода названия классам:

book
Bankaccount
systemUnit
Login_Service
banktransaction
task1

Создайте эти классы с корректными с точки зрения Java кода назнаниями. */

public class BankAccount {
    public static void main(String[] args) {

        System.out.print("Class - BankAccount");
    }
}
