package student_olga_dubrovskaja.homework.lesson_5.level_1.task1_to_task9;

// Найдите ошибку в программе и исправить её:

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
class ArrayDefinition1 {

    public static void main(String[] args) {
        int[] numbers = new int[8];
    }

}

//    Найдите ошибку в программе и исправить её:

class ArrayDefinition2 {

    public static void main(String[] args) {
        byte[] numbers = new byte[10];
    }

}


//   Найдите ошибку в программе и исправить её.
//      В переменная numbers должна ссылаться на массив целых чисел.

class ArrayDefinition3 {

    public static void main(String[] args) {
        int[] numbers = new int[10];
    }
}

//Найдите ошибку в программе и исправить её:

class ArrayDefinition4 {

    public static void main(String[] args) {
        int[] numbers = {1, 2, 3};
    }
}

// Найдите ошибку в программе и исправить её:

class ArrayDefinition5 {

    public static void main(String[] args) {
        int[] numbers = {1, 2, 3, 4};
    }
}

//  Найдите ошибку в программе и исправить её:

class ArrayDefinition6 {

    public static void main(String[] args) {
        int[] numbers = {1, 2, 3};
    }
}


// Найдите ошибку в программе и исправить её:

class ArrayLength1 {

    public static void main(String[] args) {
        int[] numbers = new int[2];
        System.out.println(numbers[1]);
    }
}

// Найдите ошибку в программе и исправить её:

class ArrayLength2 {

    public static void main(String[] args) {
        int[] numbers = new int[2];
        System.out.println(numbers[0]);
        System.out.println(numbers[1]);
    }
}

// Найдите ошибку в программе и исправить её:

class ArrayLength3 {

    public static void main(String[] args) {
        int[] numbers = new int[2];
        System.out.println(numbers.length);
    }
}


