package student_toomas_park.lesson_2.homework.level_2;

public class Task_7 {
    /*
    Дан код, нужно исправить код main() метода так,
чтобы программу можно было запустить.
Функционал класса писать не надо.
Для сдачи работы создайте исправленный класс.

public class LoginService {

	public static void main(String[] args) {
		System.out.println("You can login!");
	}


}

Цель этого задания: обратить ваше внимание на синтаксис
объявления main() метода в языке программирования Java.
     */
}
