package student_kristina_sapovalova.homework.lesson_2.Task_7;

public class LoginService {
    public static void main(String[] args) {
        System.out.println("You can login!");
    }
}


//    Дан код, нужно исправить код main() метода так,
//    чтобы программу можно было запустить.
//        Функционал класса писать не надо.
//        Для сдачи работы создайте исправленный класс.
//
//class LoginService {
//
//    public void main(String[] args) {
//        System.out.println("You can login!");
//    }
//
//
//}
//
//    Цель этого задания: обратить ваше внимание на синтаксис
//        объявления main() метода в языке программирования Java.