package student_olga_dubrovskaja.homework.lesson_3.level_2;

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
class Task7 {
    public static void main(String[] args) {
        String myName = "Olga";
        System.out.println(myName);
    }
}


//Учимся работать со строками.
//
//Тема: создание переменной типа String.
//
//Напишите программу в которой создайте переменную
//типа String и присвойте ей в качестве начального значения
//ваше имя. Выведете на консоль значение этой переменной.
//
//Пример кода:
//
//    String myName = "Viktor";
//    System.out.println(myName);