package student_Vladislavs_Solims.homework.lesson_2.level_7;

import teacher.codereview.CodeReview;

@CodeReview(approved = true)
public class Task32 {
    public static void main(String[] args) {

        /* Напишите программу и продемонстрируйте в ней использование
        однострочного и многострочного комментариев. */

        System.out.println("Dream job") ;

        //вроде всё
    }
}
