package student_Vladislavs_Solims.homework.lesson2.level7;

public class Task32 {
    public static void main(String[] args) {

        /* Напишите программу и продемонстрируйте в ней использование
        однострочного и многострочного комментариев. */

        System.out.println("Dream job") ;

        //вроде всё
    }
}
